zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TRGMUX.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_TRGMUX.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_TRGMUX
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_TRGMUX_H_)  /* Check if memory map has not been already included */
#define S32K566_TRGMUX_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- TRGMUX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TRGMUX_Peripheral_Access_Layer TRGMUX Peripheral Access Layer
 * @{
 */

/** TRGMUX - Register Layout Typedef */
typedef struct TRGMUX_Struct {
  __IO uint32_t REG_0;                             /**< TRGMUX REG_0, offset: 0x0 */
  __IO uint32_t REG_1;                             /**< TRGMUX REG_1, offset: 0x4 */
  __IO uint32_t REG_2;                             /**< TRGMUX REG_2, offset: 0x8 */
  __IO uint32_t REG_3;                             /**< TRGMUX REG_3, offset: 0xC */
  __IO uint32_t REG_4;                             /**< TRGMUX REG_4, offset: 0x10 */
  __IO uint32_t REG_5;                             /**< TRGMUX REG_5, offset: 0x14 */
  __IO uint32_t REG_6;                             /**< TRGMUX REG_6, offset: 0x18 */
  __IO uint32_t REG_7;                             /**< TRGMUX REG_7, offset: 0x1C */
  __IO uint32_t REG_8;                             /**< TRGMUX REG_8, offset: 0x20 */
  __IO uint32_t REG_9;                             /**< TRGMUX REG_9, offset: 0x24 */
  __IO uint32_t REG_10;                            /**< TRGMUX REG_10, offset: 0x28 */
  __IO uint32_t REG_11;                            /**< TRGMUX REG_11, offset: 0x2C */
  __IO uint32_t REG_12;                            /**< TRGMUX REG_12, offset: 0x30 */
  __IO uint32_t REG_13;                            /**< TRGMUX REG_13, offset: 0x34 */
  __IO uint32_t REG_14;                            /**< TRGMUX REG_14, offset: 0x38 */
  __IO uint32_t REG_15;                            /**< TRGMUX REG_15, offset: 0x3C */
  __IO uint32_t REG_16;                            /**< TRGMUX REG_16, offset: 0x40, available only on: TRGMUX_0, TRGMUX_1 (missing on LPE_TRGMUX) */
  __IO uint32_t REG_17;                            /**< TRGMUX REG_17, offset: 0x44, available only on: TRGMUX_0, TRGMUX_1 (missing on LPE_TRGMUX) */
  __IO uint32_t REG_18;                            /**< TRGMUX REG_18, offset: 0x48, available only on: TRGMUX_0, TRGMUX_1 (missing on LPE_TRGMUX) */
  __IO uint32_t REG_19;                            /**< TRGMUX REG_19, offset: 0x4C, available only on: TRGMUX_0, TRGMUX_1 (missing on LPE_TRGMUX) */
  __IO uint32_t REG_20;                            /**< TRGMUX REG_20, offset: 0x50, available only on: TRGMUX_0, TRGMUX_1 (missing on LPE_TRGMUX) */
  __IO uint32_t REG_21;                            /**< TRGMUX REG_21, offset: 0x54, available only on: TRGMUX_0, TRGMUX_1 (missing on LPE_TRGMUX) */
  __IO uint32_t REG_22;                            /**< TRGMUX REG_22, offset: 0x58, available only on: TRGMUX_0, TRGMUX_1 (missing on LPE_TRGMUX) */
  __IO uint32_t REG_23;                            /**< TRGMUX REG_23, offset: 0x5C, available only on: TRGMUX_0, TRGMUX_1 (missing on LPE_TRGMUX) */
  __IO uint32_t REG_24;                            /**< TRGMUX REG_24, offset: 0x60, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
  __IO uint32_t REG_25;                            /**< TRGMUX REG_25, offset: 0x64, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
  __IO uint32_t REG_26;                            /**< TRGMUX REG_26, offset: 0x68, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
  __IO uint32_t REG_27;                            /**< TRGMUX REG_27, offset: 0x6C, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
  __IO uint32_t REG_28;                            /**< TRGMUX REG_28, offset: 0x70, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
  __IO uint32_t REG_29;                            /**< TRGMUX REG_29, offset: 0x74, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
  __IO uint32_t REG_30;                            /**< TRGMUX REG_30, offset: 0x78, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
  __IO uint32_t REG_31;                            /**< TRGMUX REG_31, offset: 0x7C, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
  __IO uint32_t REG_32;                            /**< TRGMUX REG_32, offset: 0x80, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
  uint8_t RESERVED_0[32];
  __IO uint32_t REG_41;                            /**< TRGMUX REG_41, offset: 0xA4, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
  __IO uint32_t REG_42;                            /**< TRGMUX REG_42, offset: 0xA8, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
  __IO uint32_t REG_43;                            /**< TRGMUX REG_43, offset: 0xAC, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
  __IO uint32_t REG_44;                            /**< TRGMUX REG_44, offset: 0xB0, available only on: TRGMUX_0 (missing on LPE_TRGMUX, TRGMUX_1) */
} TRGMUX_Type, *TRGMUX_MemMapPtr;

