zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TRGMUX.h
/** Number of instances of the TRGMUX module. */
#define TRGMUX_INSTANCE_COUNT                    (3u)

/* TRGMUX - Peripheral instance base addresses */
/** Peripheral LPE_TRGMUX base address */
#define IP_LPE_TRGMUX_BASE                       (0x42084000u)
/** Peripheral LPE_TRGMUX base pointer */
#define IP_LPE_TRGMUX                            ((TRGMUX_Type *)IP_LPE_TRGMUX_BASE)
/** Peripheral TRGMUX_0 base address */
#define IP_TRGMUX_0_BASE                         (0x40600000u)
/** Peripheral TRGMUX_0 base pointer */
#define IP_TRGMUX_0                              ((TRGMUX_Type *)IP_TRGMUX_0_BASE)
/** Peripheral TRGMUX_1 base address */
#define IP_TRGMUX_1_BASE                         (0x40690000u)
/** Peripheral TRGMUX_1 base pointer */
#define IP_TRGMUX_1                              ((TRGMUX_Type *)IP_TRGMUX_1_BASE)
/** Array initializer of TRGMUX peripheral base addresses */
#define IP_TRGMUX_BASE_ADDRS                     { IP_LPE_TRGMUX_BASE, IP_TRGMUX_0_BASE, IP_TRGMUX_1_BASE }
/** Array initializer of TRGMUX peripheral base pointers */
#define IP_TRGMUX_BASE_PTRS                      { IP_LPE_TRGMUX, IP_TRGMUX_0, IP_TRGMUX_1 }

/* ----------------------------------------------------------------------------
   -- TRGMUX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TRGMUX_Register_Masks TRGMUX Register Masks
 * @{
 */

/*! @name REG_0 - TRGMUX REG_0 */
/*! @{ */

#define TRGMUX_REG_0_SEL0_MASK                   (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_0_SEL0_SHIFT                  (0U)
#define TRGMUX_REG_0_SEL0_WIDTH                  (8U)
#define TRGMUX_REG_0_SEL0(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_0_SEL0_SHIFT)) & TRGMUX_REG_0_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_0_SEL1_MASK                   (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_0_SEL1_SHIFT                  (8U)
#define TRGMUX_REG_0_SEL1_WIDTH                  (8U)
#define TRGMUX_REG_0_SEL1(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_0_SEL1_SHIFT)) & TRGMUX_REG_0_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_0_SEL2_MASK                   (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_0_SEL2_SHIFT                  (16U)
#define TRGMUX_REG_0_SEL2_WIDTH                  (8U)
#define TRGMUX_REG_0_SEL2(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_0_SEL2_SHIFT)) & TRGMUX_REG_0_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_0_SEL3_MASK                   (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_0_SEL3_SHIFT                  (24U)
#define TRGMUX_REG_0_SEL3_WIDTH                  (8U)
#define TRGMUX_REG_0_SEL3(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_0_SEL3_SHIFT)) & TRGMUX_REG_0_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_1 - TRGMUX REG_1 */
/*! @{ */

#define TRGMUX_REG_1_SEL0_MASK                   (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_1_SEL0_SHIFT                  (0U)
#define TRGMUX_REG_1_SEL0_WIDTH                  (8U)
#define TRGMUX_REG_1_SEL0(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_1_SEL0_SHIFT)) & TRGMUX_REG_1_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_1_SEL1_MASK                   (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_1_SEL1_SHIFT                  (8U)
#define TRGMUX_REG_1_SEL1_WIDTH                  (8U)
#define TRGMUX_REG_1_SEL1(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_1_SEL1_SHIFT)) & TRGMUX_REG_1_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_1_SEL2_MASK                   (0x7F0000U)  /* Merged from fields with different position or width, of widths (6, 7), largest definition used */
#define TRGMUX_REG_1_SEL2_SHIFT                  (16U)
#define TRGMUX_REG_1_SEL2_WIDTH                  (7U)
#define TRGMUX_REG_1_SEL2(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_1_SEL2_SHIFT)) & TRGMUX_REG_1_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7), largest definition used */

#define TRGMUX_REG_1_SEL3_MASK                   (0x7F000000U)  /* Merged from fields with different position or width, of widths (6, 7), largest definition used */
#define TRGMUX_REG_1_SEL3_SHIFT                  (24U)
#define TRGMUX_REG_1_SEL3_WIDTH                  (7U)
#define TRGMUX_REG_1_SEL3(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_1_SEL3_SHIFT)) & TRGMUX_REG_1_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7), largest definition used */
/*! @} */

/*! @name REG_2 - TRGMUX REG_2 */
/*! @{ */

#define TRGMUX_REG_2_SEL0_MASK                   (0x7FU)  /* Merged from fields with different position or width, of widths (6, 7), largest definition used */
#define TRGMUX_REG_2_SEL0_SHIFT                  (0U)
#define TRGMUX_REG_2_SEL0_WIDTH                  (7U)
#define TRGMUX_REG_2_SEL0(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_2_SEL0_SHIFT)) & TRGMUX_REG_2_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7), largest definition used */

