zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TRGMUX.h
#define TRGMUX_REG_2_SEL1_MASK                   (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_2_SEL1_SHIFT                  (8U)
#define TRGMUX_REG_2_SEL1_WIDTH                  (8U)
#define TRGMUX_REG_2_SEL1(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_2_SEL1_SHIFT)) & TRGMUX_REG_2_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_2_SEL2_MASK                   (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_2_SEL2_SHIFT                  (16U)
#define TRGMUX_REG_2_SEL2_WIDTH                  (8U)
#define TRGMUX_REG_2_SEL2(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_2_SEL2_SHIFT)) & TRGMUX_REG_2_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_2_SEL3_MASK                   (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_2_SEL3_SHIFT                  (24U)
#define TRGMUX_REG_2_SEL3_WIDTH                  (8U)
#define TRGMUX_REG_2_SEL3(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_2_SEL3_SHIFT)) & TRGMUX_REG_2_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_3 - TRGMUX REG_3 */
/*! @{ */

#define TRGMUX_REG_3_SEL0_MASK                   (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_3_SEL0_SHIFT                  (0U)
#define TRGMUX_REG_3_SEL0_WIDTH                  (8U)
#define TRGMUX_REG_3_SEL0(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_3_SEL0_SHIFT)) & TRGMUX_REG_3_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_3_SEL1_MASK                   (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_3_SEL1_SHIFT                  (8U)
#define TRGMUX_REG_3_SEL1_WIDTH                  (8U)
#define TRGMUX_REG_3_SEL1(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_3_SEL1_SHIFT)) & TRGMUX_REG_3_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_3_SEL2_MASK                   (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_3_SEL2_SHIFT                  (16U)
#define TRGMUX_REG_3_SEL2_WIDTH                  (8U)
#define TRGMUX_REG_3_SEL2(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_3_SEL2_SHIFT)) & TRGMUX_REG_3_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_3_SEL3_MASK                   (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_3_SEL3_SHIFT                  (24U)
#define TRGMUX_REG_3_SEL3_WIDTH                  (8U)
#define TRGMUX_REG_3_SEL3(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_3_SEL3_SHIFT)) & TRGMUX_REG_3_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_4 - TRGMUX REG_4 */
/*! @{ */

#define TRGMUX_REG_4_SEL0_MASK                   (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_4_SEL0_SHIFT                  (0U)
#define TRGMUX_REG_4_SEL0_WIDTH                  (8U)
#define TRGMUX_REG_4_SEL0(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_4_SEL0_SHIFT)) & TRGMUX_REG_4_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_4_SEL1_MASK                   (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_4_SEL1_SHIFT                  (8U)
#define TRGMUX_REG_4_SEL1_WIDTH                  (8U)
#define TRGMUX_REG_4_SEL1(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_4_SEL1_SHIFT)) & TRGMUX_REG_4_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_4_SEL2_MASK                   (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_4_SEL2_SHIFT                  (16U)
#define TRGMUX_REG_4_SEL2_WIDTH                  (8U)
#define TRGMUX_REG_4_SEL2(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_4_SEL2_SHIFT)) & TRGMUX_REG_4_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_4_SEL3_MASK                   (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_4_SEL3_SHIFT                  (24U)
#define TRGMUX_REG_4_SEL3_WIDTH                  (8U)
#define TRGMUX_REG_4_SEL3(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_4_SEL3_SHIFT)) & TRGMUX_REG_4_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_5 - TRGMUX REG_5 */
/*! @{ */

#define TRGMUX_REG_5_SEL0_MASK                   (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_5_SEL0_SHIFT                  (0U)
#define TRGMUX_REG_5_SEL0_WIDTH                  (8U)
#define TRGMUX_REG_5_SEL0(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_5_SEL0_SHIFT)) & TRGMUX_REG_5_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_5_SEL1_MASK                   (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_5_SEL1_SHIFT                  (8U)
#define TRGMUX_REG_5_SEL1_WIDTH                  (8U)
#define TRGMUX_REG_5_SEL1(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_5_SEL1_SHIFT)) & TRGMUX_REG_5_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

