zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TRGMUX.h
#define TRGMUX_REG_5_SEL2_MASK                   (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_5_SEL2_SHIFT                  (16U)
#define TRGMUX_REG_5_SEL2_WIDTH                  (8U)
#define TRGMUX_REG_5_SEL2(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_5_SEL2_SHIFT)) & TRGMUX_REG_5_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_5_SEL3_MASK                   (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_5_SEL3_SHIFT                  (24U)
#define TRGMUX_REG_5_SEL3_WIDTH                  (8U)
#define TRGMUX_REG_5_SEL3(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_5_SEL3_SHIFT)) & TRGMUX_REG_5_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_6 - TRGMUX REG_6 */
/*! @{ */

#define TRGMUX_REG_6_SEL0_MASK                   (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_6_SEL0_SHIFT                  (0U)
#define TRGMUX_REG_6_SEL0_WIDTH                  (8U)
#define TRGMUX_REG_6_SEL0(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_6_SEL0_SHIFT)) & TRGMUX_REG_6_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_6_SEL1_MASK                   (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_6_SEL1_SHIFT                  (8U)
#define TRGMUX_REG_6_SEL1_WIDTH                  (8U)
#define TRGMUX_REG_6_SEL1(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_6_SEL1_SHIFT)) & TRGMUX_REG_6_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_6_SEL2_MASK                   (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_6_SEL2_SHIFT                  (16U)
#define TRGMUX_REG_6_SEL2_WIDTH                  (8U)
#define TRGMUX_REG_6_SEL2(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_6_SEL2_SHIFT)) & TRGMUX_REG_6_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_6_SEL3_MASK                   (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_6_SEL3_SHIFT                  (24U)
#define TRGMUX_REG_6_SEL3_WIDTH                  (8U)
#define TRGMUX_REG_6_SEL3(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_6_SEL3_SHIFT)) & TRGMUX_REG_6_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_7 - TRGMUX REG_7 */
/*! @{ */

#define TRGMUX_REG_7_SEL0_MASK                   (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_7_SEL0_SHIFT                  (0U)
#define TRGMUX_REG_7_SEL0_WIDTH                  (8U)
#define TRGMUX_REG_7_SEL0(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_7_SEL0_SHIFT)) & TRGMUX_REG_7_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_7_SEL1_MASK                   (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_7_SEL1_SHIFT                  (8U)
#define TRGMUX_REG_7_SEL1_WIDTH                  (8U)
#define TRGMUX_REG_7_SEL1(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_7_SEL1_SHIFT)) & TRGMUX_REG_7_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_7_SEL2_MASK                   (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_7_SEL2_SHIFT                  (16U)
#define TRGMUX_REG_7_SEL2_WIDTH                  (8U)
#define TRGMUX_REG_7_SEL2(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_7_SEL2_SHIFT)) & TRGMUX_REG_7_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_7_SEL3_MASK                   (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_7_SEL3_SHIFT                  (24U)
#define TRGMUX_REG_7_SEL3_WIDTH                  (8U)
#define TRGMUX_REG_7_SEL3(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_7_SEL3_SHIFT)) & TRGMUX_REG_7_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_8 - TRGMUX REG_8 */
/*! @{ */

#define TRGMUX_REG_8_SEL0_MASK                   (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_8_SEL0_SHIFT                  (0U)
#define TRGMUX_REG_8_SEL0_WIDTH                  (8U)
#define TRGMUX_REG_8_SEL0(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_8_SEL0_SHIFT)) & TRGMUX_REG_8_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_8_SEL1_MASK                   (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_8_SEL1_SHIFT                  (8U)
#define TRGMUX_REG_8_SEL1_WIDTH                  (8U)
#define TRGMUX_REG_8_SEL1(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_8_SEL1_SHIFT)) & TRGMUX_REG_8_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_8_SEL2_MASK                   (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_8_SEL2_SHIFT                  (16U)
#define TRGMUX_REG_8_SEL2_WIDTH                  (8U)
#define TRGMUX_REG_8_SEL2(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_8_SEL2_SHIFT)) & TRGMUX_REG_8_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_8_SEL3_MASK                   (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_8_SEL3_SHIFT                  (24U)
#define TRGMUX_REG_8_SEL3_WIDTH                  (8U)
#define TRGMUX_REG_8_SEL3(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_8_SEL3_SHIFT)) & TRGMUX_REG_8_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_9 - TRGMUX REG_9 */
/*! @{ */

