zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TRGMUX.h
#define TRGMUX_REG_9_SEL0_MASK                   (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_9_SEL0_SHIFT                  (0U)
#define TRGMUX_REG_9_SEL0_WIDTH                  (8U)
#define TRGMUX_REG_9_SEL0(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_9_SEL0_SHIFT)) & TRGMUX_REG_9_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_9_SEL1_MASK                   (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_9_SEL1_SHIFT                  (8U)
#define TRGMUX_REG_9_SEL1_WIDTH                  (8U)
#define TRGMUX_REG_9_SEL1(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_9_SEL1_SHIFT)) & TRGMUX_REG_9_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_9_SEL2_MASK                   (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_9_SEL2_SHIFT                  (16U)
#define TRGMUX_REG_9_SEL2_WIDTH                  (8U)
#define TRGMUX_REG_9_SEL2(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_9_SEL2_SHIFT)) & TRGMUX_REG_9_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_9_SEL3_MASK                   (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_9_SEL3_SHIFT                  (24U)
#define TRGMUX_REG_9_SEL3_WIDTH                  (8U)
#define TRGMUX_REG_9_SEL3(x)                     (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_9_SEL3_SHIFT)) & TRGMUX_REG_9_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_10 - TRGMUX REG_10 */
/*! @{ */

#define TRGMUX_REG_10_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_10_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_10_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_10_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_10_SEL0_SHIFT)) & TRGMUX_REG_10_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_10_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_10_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_10_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_10_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_10_SEL1_SHIFT)) & TRGMUX_REG_10_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_10_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_10_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_10_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_10_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_10_SEL2_SHIFT)) & TRGMUX_REG_10_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_10_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_10_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_10_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_10_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_10_SEL3_SHIFT)) & TRGMUX_REG_10_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_11 - TRGMUX REG_11 */
/*! @{ */

#define TRGMUX_REG_11_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_11_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_11_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_11_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_11_SEL0_SHIFT)) & TRGMUX_REG_11_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_11_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_11_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_11_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_11_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_11_SEL1_SHIFT)) & TRGMUX_REG_11_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_11_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_11_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_11_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_11_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_11_SEL2_SHIFT)) & TRGMUX_REG_11_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_11_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_11_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_11_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_11_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_11_SEL3_SHIFT)) & TRGMUX_REG_11_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_12 - TRGMUX REG_12 */
/*! @{ */

