zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TRGMUX.h
#define TRGMUX_REG_12_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_12_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_12_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_12_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_12_SEL0_SHIFT)) & TRGMUX_REG_12_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_12_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_12_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_12_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_12_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_12_SEL1_SHIFT)) & TRGMUX_REG_12_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_12_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_12_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_12_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_12_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_12_SEL2_SHIFT)) & TRGMUX_REG_12_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_12_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_12_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_12_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_12_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_12_SEL3_SHIFT)) & TRGMUX_REG_12_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_13 - TRGMUX REG_13 */
/*! @{ */

#define TRGMUX_REG_13_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_13_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_13_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_13_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_13_SEL0_SHIFT)) & TRGMUX_REG_13_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_13_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_13_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_13_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_13_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_13_SEL1_SHIFT)) & TRGMUX_REG_13_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_13_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_13_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_13_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_13_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_13_SEL2_SHIFT)) & TRGMUX_REG_13_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_13_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_13_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_13_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_13_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_13_SEL3_SHIFT)) & TRGMUX_REG_13_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_14 - TRGMUX REG_14 */
/*! @{ */

#define TRGMUX_REG_14_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_14_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_14_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_14_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_14_SEL0_SHIFT)) & TRGMUX_REG_14_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_14_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_14_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_14_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_14_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_14_SEL1_SHIFT)) & TRGMUX_REG_14_SEL1_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_14_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_14_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_14_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_14_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_14_SEL2_SHIFT)) & TRGMUX_REG_14_SEL2_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_14_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_14_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_14_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_14_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_14_SEL3_SHIFT)) & TRGMUX_REG_14_SEL3_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
/*! @} */

/*! @name REG_15 - TRGMUX REG_15 */
/*! @{ */

#define TRGMUX_REG_15_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */
#define TRGMUX_REG_15_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_15_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_15_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_15_SEL0_SHIFT)) & TRGMUX_REG_15_SEL0_MASK)  /* Merged from fields with different position or width, of widths (6, 7, 8), largest definition used */

#define TRGMUX_REG_15_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_15_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_15_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_15_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_15_SEL1_SHIFT)) & TRGMUX_REG_15_SEL1_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_15_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_15_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_15_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_15_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_15_SEL2_SHIFT)) & TRGMUX_REG_15_SEL2_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

