zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TRGMUX.h
#define TRGMUX_REG_15_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_15_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_15_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_15_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_15_SEL3_SHIFT)) & TRGMUX_REG_15_SEL3_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
/*! @} */

/*! @name REG_16 - TRGMUX REG_16 */
/*! @{ */

#define TRGMUX_REG_16_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_16_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_16_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_16_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_16_SEL0_SHIFT)) & TRGMUX_REG_16_SEL0_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_16_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_16_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_16_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_16_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_16_SEL1_SHIFT)) & TRGMUX_REG_16_SEL1_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_16_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_16_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_16_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_16_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_16_SEL2_SHIFT)) & TRGMUX_REG_16_SEL2_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_16_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_16_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_16_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_16_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_16_SEL3_SHIFT)) & TRGMUX_REG_16_SEL3_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
/*! @} */

/*! @name REG_17 - TRGMUX REG_17 */
/*! @{ */

#define TRGMUX_REG_17_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_17_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_17_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_17_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_17_SEL0_SHIFT)) & TRGMUX_REG_17_SEL0_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_17_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_17_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_17_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_17_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_17_SEL1_SHIFT)) & TRGMUX_REG_17_SEL1_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_17_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_17_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_17_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_17_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_17_SEL2_SHIFT)) & TRGMUX_REG_17_SEL2_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_17_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_17_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_17_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_17_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_17_SEL3_SHIFT)) & TRGMUX_REG_17_SEL3_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
/*! @} */

/*! @name REG_18 - TRGMUX REG_18 */
/*! @{ */

#define TRGMUX_REG_18_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_18_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_18_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_18_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_18_SEL0_SHIFT)) & TRGMUX_REG_18_SEL0_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_18_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_18_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_18_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_18_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_18_SEL1_SHIFT)) & TRGMUX_REG_18_SEL1_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_18_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_18_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_18_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_18_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_18_SEL2_SHIFT)) & TRGMUX_REG_18_SEL2_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

