zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TRGMUX.h
#define TRGMUX_REG_18_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_18_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_18_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_18_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_18_SEL3_SHIFT)) & TRGMUX_REG_18_SEL3_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
/*! @} */

/*! @name REG_19 - TRGMUX REG_19 */
/*! @{ */

#define TRGMUX_REG_19_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_19_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_19_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_19_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_19_SEL0_SHIFT)) & TRGMUX_REG_19_SEL0_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_19_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_19_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_19_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_19_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_19_SEL1_SHIFT)) & TRGMUX_REG_19_SEL1_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_19_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_19_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_19_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_19_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_19_SEL2_SHIFT)) & TRGMUX_REG_19_SEL2_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_19_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_19_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_19_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_19_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_19_SEL3_SHIFT)) & TRGMUX_REG_19_SEL3_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
/*! @} */

/*! @name REG_20 - TRGMUX REG_20 */
/*! @{ */

#define TRGMUX_REG_20_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_20_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_20_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_20_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_20_SEL0_SHIFT)) & TRGMUX_REG_20_SEL0_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_20_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_20_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_20_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_20_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_20_SEL1_SHIFT)) & TRGMUX_REG_20_SEL1_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_20_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_20_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_20_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_20_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_20_SEL2_SHIFT)) & TRGMUX_REG_20_SEL2_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_20_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_20_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_20_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_20_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_20_SEL3_SHIFT)) & TRGMUX_REG_20_SEL3_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
/*! @} */

/*! @name REG_21 - TRGMUX REG_21 */
/*! @{ */

#define TRGMUX_REG_21_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_21_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_21_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_21_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_21_SEL0_SHIFT)) & TRGMUX_REG_21_SEL0_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_21_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_21_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_21_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_21_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_21_SEL1_SHIFT)) & TRGMUX_REG_21_SEL1_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_21_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_21_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_21_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_21_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_21_SEL2_SHIFT)) & TRGMUX_REG_21_SEL2_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_21_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_21_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_21_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_21_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_21_SEL3_SHIFT)) & TRGMUX_REG_21_SEL3_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
/*! @} */

