zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TRGMUX.h
/*! @name REG_22 - TRGMUX REG_22 */
/*! @{ */

#define TRGMUX_REG_22_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_22_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_22_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_22_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_22_SEL0_SHIFT)) & TRGMUX_REG_22_SEL0_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_22_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_22_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_22_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_22_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_22_SEL1_SHIFT)) & TRGMUX_REG_22_SEL1_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_22_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_22_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_22_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_22_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_22_SEL2_SHIFT)) & TRGMUX_REG_22_SEL2_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_22_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_22_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_22_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_22_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_22_SEL3_SHIFT)) & TRGMUX_REG_22_SEL3_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
/*! @} */

/*! @name REG_23 - TRGMUX REG_23 */
/*! @{ */

#define TRGMUX_REG_23_SEL0_MASK                  (0xFFU)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_23_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_23_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_23_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_23_SEL0_SHIFT)) & TRGMUX_REG_23_SEL0_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_23_SEL1_MASK                  (0xFF00U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_23_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_23_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_23_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_23_SEL1_SHIFT)) & TRGMUX_REG_23_SEL1_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_23_SEL2_MASK                  (0xFF0000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_23_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_23_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_23_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_23_SEL2_SHIFT)) & TRGMUX_REG_23_SEL2_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */

#define TRGMUX_REG_23_SEL3_MASK                  (0xFF000000U)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
#define TRGMUX_REG_23_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_23_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_23_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_23_SEL3_SHIFT)) & TRGMUX_REG_23_SEL3_MASK)  /* Merged from fields with different position or width, of widths (7, 8), largest definition used */
/*! @} */

/*! @name REG_24 - TRGMUX REG_24 */
/*! @{ */

#define TRGMUX_REG_24_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_24_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_24_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_24_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_24_SEL0_SHIFT)) & TRGMUX_REG_24_SEL0_MASK)

#define TRGMUX_REG_24_SEL1_MASK                  (0xFF00U)
#define TRGMUX_REG_24_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_24_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_24_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_24_SEL1_SHIFT)) & TRGMUX_REG_24_SEL1_MASK)

#define TRGMUX_REG_24_SEL2_MASK                  (0xFF0000U)
#define TRGMUX_REG_24_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_24_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_24_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_24_SEL2_SHIFT)) & TRGMUX_REG_24_SEL2_MASK)

#define TRGMUX_REG_24_SEL3_MASK                  (0xFF000000U)
#define TRGMUX_REG_24_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_24_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_24_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_24_SEL3_SHIFT)) & TRGMUX_REG_24_SEL3_MASK)
/*! @} */

/*! @name REG_25 - TRGMUX REG_25 */
/*! @{ */

#define TRGMUX_REG_25_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_25_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_25_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_25_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_25_SEL0_SHIFT)) & TRGMUX_REG_25_SEL0_MASK)

#define TRGMUX_REG_25_SEL1_MASK                  (0xFF00U)
#define TRGMUX_REG_25_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_25_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_25_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_25_SEL1_SHIFT)) & TRGMUX_REG_25_SEL1_MASK)

#define TRGMUX_REG_25_SEL2_MASK                  (0xFF0000U)
#define TRGMUX_REG_25_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_25_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_25_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_25_SEL2_SHIFT)) & TRGMUX_REG_25_SEL2_MASK)

