zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TRGMUX.h
#define TRGMUX_REG_25_SEL3_MASK                  (0xFF000000U)
#define TRGMUX_REG_25_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_25_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_25_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_25_SEL3_SHIFT)) & TRGMUX_REG_25_SEL3_MASK)
/*! @} */

/*! @name REG_26 - TRGMUX REG_26 */
/*! @{ */

#define TRGMUX_REG_26_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_26_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_26_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_26_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_26_SEL0_SHIFT)) & TRGMUX_REG_26_SEL0_MASK)

#define TRGMUX_REG_26_SEL1_MASK                  (0xFF00U)
#define TRGMUX_REG_26_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_26_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_26_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_26_SEL1_SHIFT)) & TRGMUX_REG_26_SEL1_MASK)

#define TRGMUX_REG_26_SEL2_MASK                  (0xFF0000U)
#define TRGMUX_REG_26_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_26_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_26_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_26_SEL2_SHIFT)) & TRGMUX_REG_26_SEL2_MASK)

#define TRGMUX_REG_26_SEL3_MASK                  (0xFF000000U)
#define TRGMUX_REG_26_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_26_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_26_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_26_SEL3_SHIFT)) & TRGMUX_REG_26_SEL3_MASK)
/*! @} */

/*! @name REG_27 - TRGMUX REG_27 */
/*! @{ */

#define TRGMUX_REG_27_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_27_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_27_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_27_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_27_SEL0_SHIFT)) & TRGMUX_REG_27_SEL0_MASK)

#define TRGMUX_REG_27_SEL1_MASK                  (0xFF00U)
#define TRGMUX_REG_27_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_27_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_27_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_27_SEL1_SHIFT)) & TRGMUX_REG_27_SEL1_MASK)

#define TRGMUX_REG_27_SEL2_MASK                  (0xFF0000U)
#define TRGMUX_REG_27_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_27_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_27_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_27_SEL2_SHIFT)) & TRGMUX_REG_27_SEL2_MASK)

#define TRGMUX_REG_27_SEL3_MASK                  (0xFF000000U)
#define TRGMUX_REG_27_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_27_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_27_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_27_SEL3_SHIFT)) & TRGMUX_REG_27_SEL3_MASK)
/*! @} */

/*! @name REG_28 - TRGMUX REG_28 */
/*! @{ */

#define TRGMUX_REG_28_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_28_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_28_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_28_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_28_SEL0_SHIFT)) & TRGMUX_REG_28_SEL0_MASK)

#define TRGMUX_REG_28_SEL1_MASK                  (0xFF00U)
#define TRGMUX_REG_28_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_28_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_28_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_28_SEL1_SHIFT)) & TRGMUX_REG_28_SEL1_MASK)

#define TRGMUX_REG_28_SEL2_MASK                  (0xFF0000U)
#define TRGMUX_REG_28_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_28_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_28_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_28_SEL2_SHIFT)) & TRGMUX_REG_28_SEL2_MASK)

#define TRGMUX_REG_28_SEL3_MASK                  (0xFF000000U)
#define TRGMUX_REG_28_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_28_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_28_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_28_SEL3_SHIFT)) & TRGMUX_REG_28_SEL3_MASK)
/*! @} */

/*! @name REG_29 - TRGMUX REG_29 */
/*! @{ */

#define TRGMUX_REG_29_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_29_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_29_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_29_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_29_SEL0_SHIFT)) & TRGMUX_REG_29_SEL0_MASK)

#define TRGMUX_REG_29_SEL1_MASK                  (0xFF00U)
#define TRGMUX_REG_29_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_29_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_29_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_29_SEL1_SHIFT)) & TRGMUX_REG_29_SEL1_MASK)

#define TRGMUX_REG_29_SEL2_MASK                  (0xFF0000U)
#define TRGMUX_REG_29_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_29_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_29_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_29_SEL2_SHIFT)) & TRGMUX_REG_29_SEL2_MASK)

#define TRGMUX_REG_29_SEL3_MASK                  (0xFF000000U)
#define TRGMUX_REG_29_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_29_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_29_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_29_SEL3_SHIFT)) & TRGMUX_REG_29_SEL3_MASK)
/*! @} */

/*! @name REG_30 - TRGMUX REG_30 */
/*! @{ */

#define TRGMUX_REG_30_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_30_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_30_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_30_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_30_SEL0_SHIFT)) & TRGMUX_REG_30_SEL0_MASK)

#define TRGMUX_REG_30_SEL1_MASK                  (0xFF00U)
#define TRGMUX_REG_30_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_30_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_30_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_30_SEL1_SHIFT)) & TRGMUX_REG_30_SEL1_MASK)

