zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TRGMUX.h
#define TRGMUX_REG_30_SEL2_MASK                  (0xFF0000U)
#define TRGMUX_REG_30_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_30_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_30_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_30_SEL2_SHIFT)) & TRGMUX_REG_30_SEL2_MASK)

#define TRGMUX_REG_30_SEL3_MASK                  (0xFF000000U)
#define TRGMUX_REG_30_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_30_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_30_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_30_SEL3_SHIFT)) & TRGMUX_REG_30_SEL3_MASK)
/*! @} */

/*! @name REG_31 - TRGMUX REG_31 */
/*! @{ */

#define TRGMUX_REG_31_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_31_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_31_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_31_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_31_SEL0_SHIFT)) & TRGMUX_REG_31_SEL0_MASK)

#define TRGMUX_REG_31_SEL1_MASK                  (0xFF00U)
#define TRGMUX_REG_31_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_31_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_31_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_31_SEL1_SHIFT)) & TRGMUX_REG_31_SEL1_MASK)

#define TRGMUX_REG_31_SEL2_MASK                  (0xFF0000U)
#define TRGMUX_REG_31_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_31_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_31_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_31_SEL2_SHIFT)) & TRGMUX_REG_31_SEL2_MASK)

#define TRGMUX_REG_31_SEL3_MASK                  (0xFF000000U)
#define TRGMUX_REG_31_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_31_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_31_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_31_SEL3_SHIFT)) & TRGMUX_REG_31_SEL3_MASK)
/*! @} */

/*! @name REG_32 - TRGMUX REG_32 */
/*! @{ */

#define TRGMUX_REG_32_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_32_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_32_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_32_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_32_SEL0_SHIFT)) & TRGMUX_REG_32_SEL0_MASK)

#define TRGMUX_REG_32_SEL1_MASK                  (0xFF00U)
#define TRGMUX_REG_32_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_32_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_32_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_32_SEL1_SHIFT)) & TRGMUX_REG_32_SEL1_MASK)

#define TRGMUX_REG_32_SEL2_MASK                  (0xFF0000U)
#define TRGMUX_REG_32_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_32_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_32_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_32_SEL2_SHIFT)) & TRGMUX_REG_32_SEL2_MASK)
/*! @} */

/*! @name REG_41 - TRGMUX REG_41 */
/*! @{ */

#define TRGMUX_REG_41_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_41_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_41_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_41_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_41_SEL0_SHIFT)) & TRGMUX_REG_41_SEL0_MASK)

#define TRGMUX_REG_41_SEL1_MASK                  (0xFF00U)
#define TRGMUX_REG_41_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_41_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_41_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_41_SEL1_SHIFT)) & TRGMUX_REG_41_SEL1_MASK)

#define TRGMUX_REG_41_SEL2_MASK                  (0xFF0000U)
#define TRGMUX_REG_41_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_41_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_41_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_41_SEL2_SHIFT)) & TRGMUX_REG_41_SEL2_MASK)

#define TRGMUX_REG_41_SEL3_MASK                  (0xFF000000U)
#define TRGMUX_REG_41_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_41_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_41_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_41_SEL3_SHIFT)) & TRGMUX_REG_41_SEL3_MASK)
/*! @} */

/*! @name REG_42 - TRGMUX REG_42 */
/*! @{ */

#define TRGMUX_REG_42_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_42_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_42_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_42_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_42_SEL0_SHIFT)) & TRGMUX_REG_42_SEL0_MASK)

#define TRGMUX_REG_42_SEL1_MASK                  (0xFF00U)
#define TRGMUX_REG_42_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_42_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_42_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_42_SEL1_SHIFT)) & TRGMUX_REG_42_SEL1_MASK)

#define TRGMUX_REG_42_SEL2_MASK                  (0xFF0000U)
#define TRGMUX_REG_42_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_42_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_42_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_42_SEL2_SHIFT)) & TRGMUX_REG_42_SEL2_MASK)

#define TRGMUX_REG_42_SEL3_MASK                  (0xFF000000U)
#define TRGMUX_REG_42_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_42_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_42_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_42_SEL3_SHIFT)) & TRGMUX_REG_42_SEL3_MASK)
/*! @} */

/*! @name REG_43 - TRGMUX REG_43 */
/*! @{ */

#define TRGMUX_REG_43_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_43_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_43_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_43_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_43_SEL0_SHIFT)) & TRGMUX_REG_43_SEL0_MASK)

#define TRGMUX_REG_43_SEL1_MASK                  (0xFF00U)
#define TRGMUX_REG_43_SEL1_SHIFT                 (8U)
#define TRGMUX_REG_43_SEL1_WIDTH                 (8U)
#define TRGMUX_REG_43_SEL1(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_43_SEL1_SHIFT)) & TRGMUX_REG_43_SEL1_MASK)

#define TRGMUX_REG_43_SEL2_MASK                  (0xFF0000U)
#define TRGMUX_REG_43_SEL2_SHIFT                 (16U)
#define TRGMUX_REG_43_SEL2_WIDTH                 (8U)
#define TRGMUX_REG_43_SEL2(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_43_SEL2_SHIFT)) & TRGMUX_REG_43_SEL2_MASK)

#define TRGMUX_REG_43_SEL3_MASK                  (0xFF000000U)
#define TRGMUX_REG_43_SEL3_SHIFT                 (24U)
#define TRGMUX_REG_43_SEL3_WIDTH                 (8U)
#define TRGMUX_REG_43_SEL3(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_43_SEL3_SHIFT)) & TRGMUX_REG_43_SEL3_MASK)
/*! @} */

/*! @name REG_44 - TRGMUX REG_44 */
/*! @{ */

#define TRGMUX_REG_44_SEL0_MASK                  (0xFFU)
#define TRGMUX_REG_44_SEL0_SHIFT                 (0U)
#define TRGMUX_REG_44_SEL0_WIDTH                 (8U)
#define TRGMUX_REG_44_SEL0(x)                    (((uint32_t)(((uint32_t)(x)) << TRGMUX_REG_44_SEL0_SHIFT)) & TRGMUX_REG_44_SEL0_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group TRGMUX_Register_Masks */

/*!
 * @}
 */ /* end of group TRGMUX_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_TRGMUX_H_) */
